interface CompanyHistory {
  date: string;
  title: string;
}

export const companyHistory: CompanyHistory[] = [
  {
    date: '昭和25年',
    title: '大力紙店創業',
  },
  {
    date: '昭和30年',
    title: '大黒ナプキン工業社に社名変更・伊予三島第一工場新設',
  },
  {
    date: '昭和37年',
    title: '伊予三島第二工場新設',
  },
  {
    date: '昭和47年',
    title: '大黒工業株式会社に社名変更・川之江工場新設',
  },
  {
    date: '昭和49年',
    title: '北海道営業所新設',
  },
  {
    date: '昭和53年',
    title: '関東営業所新設・九州営業所新設',
  },
  {
    date: '昭和55年',
    title: '近畿営業所新設・大黒コンピュターセンター（株）設立',
  },
  {
    date: '昭和57年',
    title: '東北営業所新設',
  },
  {
    date: '昭和59年',
    title: '仙台工場新設',
  },
  {
    date: '昭和60年',
    title: '中部営業所新設',
  },
  {
    date: '昭和61年',
    title: '清水工場新設・東京事務所開設',
  },
  {
    date: '昭和62年',
    title: '新潟出張所開設・金沢出張所開設・鹿児島出張所開設',
  },
  {
    date: '昭和63年',
    title: 'ダイコクトレーディング（株）設立・台湾大黒股枌有限公司設立',
  },
  {
    date: '平成元年',
    title: '香川県豊中工場新設（香川県）',
  },
  {
    date: '平成2年',
    title: '大阪事務所開設・（株）ダイコクフーズ設立・日本農材（株）設立',
  },
  {
    date: '平成3年',
    title: '本社ビル完成・東京支店新設・金沢工場新設',
  },
  {
    date: '平成4年',
    title: '大阪支店新設・名古屋支店新設',
  },
  {
    date: '平成5年',
    title: 'ダイコク化成（株）設立・盛岡工場新設・東日本配送センター新設（仙台市）',
  },
  {
    date: '平成6年',
    title: '西日本配送センター新設（香川県豊中）・中国烟台工場新設・仙台工場新設・福岡営業所新設',
  },
  {
    date: '平成7年',
    title: 'パオ事業部開設',
  },
  {
    date: '平成8年',
    title: 'パオ三島店新設・東京支店（東京営業所）移転・パオ東京店新設',
  },
  {
    date: '平成9年',
    title: '関西配送センター開設（兵庫県山崎）・マーケティング事業本部設立',
  },
  {
    date: '平成11年',
    title: '大阪支店（大阪営業所）移転・東京支店を東京支社に昇格・パオ大阪店新設',
  },
  {
    date: '平成12年',
    title:
      '創業50周年・エコロジーショールーム開設（東京支社）・中国第二工場新設（パルプモールド）・大黒友愛紙工㈱設立',
  },
  {
    date: '平成14年',
    title:
      '各販売会社、コンピューターセンター、ダイコクトレーディングが当社と合併・ISO9002取得・盛岡出張所開設',
  },
  {
    date: '平成15年',
    title: 'パルプモールド事業本部設立・帯広出張所開設・ISO9001取得・煙台駐在員事務所新設',
  },
  {
    date: '平成16年',
    title: '神奈川営業所新設',
  },
  {
    date: '平成17年',
    title: '上海工場新設・煙台第三工場新設',
  },
  {
    date: '平成19年',
    title:
      '大黒友愛紙工（株）山本工場新設（香川県）・東日本配送センター新設（新潟県）・新潟出張所新設・煙台大力餐具有限公司新設',
  },
  {
    date: '平成22年',
    title: '乳山昌盛大力環保有限公司新設（中国山東省）・大黒美術紙工(株)山本工場新設',
  },
  {
    date: '平成26年',
    title: '3月 本社展示場・書庫新設 豊浜倉庫（香川県）新設',
  },
  {
    date: '平成26年',
    title: '11月 株式取得により丸三化成㈱（秋田県横手市）を子会社化',
  },
  {
    date: '平成28年',
    title: '株式取得により株式会社さくら（愛媛県四国中央市）を子会社化',
  },
  {
    date: '平成28年',
    title: '旭耀新材料科技有限公司（中国江蘇省淮安市）の工場新設',
  },
  {
    date: '平成29年',
    title: '2月　DaikokuThailand、FreshMateThailand　新設（バンコク）',
  },
  {
    date: '平成29年',
    title: '6月　一般財団法人さくら財団設立',
  },
  {
    date: '平成30年',
    title: 'さくら財団が公益財団法人に認定',
  },
];
