export interface Company {
  department: {
    id: number;
    name: string;
    meisai: Array<{
      id: number;
      name: string;
      address: string;
      tel: string | undefined;
    }>;
  };
}

export const companyData: Company[] = [
  {
    department: {
      id: 1000,
      name: '本社',
      meisai: [
        {
          id: 100,
          name: '本社',
          address: '799-0493 愛媛県四国中央市中曽根町1593',
          tel: '0896-24-2140',
        },
        {
          id: 101,
          name: '商品部',
          address: '799-0493 愛媛県四国中央市中曽根町1593',
          tel: '0896-24-2140',
        },
        {
          id: 102,
          name: 'パオ事業本部',
          address: '799-0493 愛媛県四国中央市中曽根町1593',
          tel: '0896-23-8106',
        },
        {
          id: 103,
          name: 'パオ三島店',
          address: '799-0411 愛媛県四国中央市下柏町79',
          tel: '0896-24-6011',
        },
      ],
    },
  },
  {
    department: {
      id: 2000,
      name: '仙台営業部',
      meisai: [
        {
          id: 1100,
          name: '札幌営業所',
          address: '006-0012 北海道札幌市手稲区富丘二条3丁目2-11',
          tel: '011-684-2461',
        },
        {
          id: 2100,
          name: '仙台営業所',
          address: '984-0002 宮城県仙台市若林区卸町東5丁目3-2',
          tel: '022-287-3374',
        },
        {
          id: 2200,
          name: '盛岡営業所',
          address: '020-0052 岩手県盛岡市中太田25-11',
          tel: '019-659-2393',
        },
      ],
    },
  },
  {
    department: {
      id: 3000,
      name: '東京営業部',
      meisai: [
        {
          id: 3200,
          name: '東京営業所',
          address: '110-0005 東京都台東区上野7丁目11-6 上野中央ビル4階',
          tel: '03-3845-5311',
        },
        {
          id: 3100,
          name: '埼玉営業所',
          address: '362-0015 埼玉県上尾市緑丘2丁目7-21',
          tel: '048-773-7161',
        },
        {
          id: 3300,
          name: '神奈川営業所',
          address: '243-0014 神奈川県厚木市旭町5丁目43-14 パストラルASAHI403号',
          tel: '046-220-0715',
        },
        {
          id: 3500,
          name: '新潟営業所',
          address: '959-1276 新潟県燕市小池字上通り5091-14',
          tel: '0256-66-4010',
        },
      ],
    },
  },

  {
    department: {
      id: 5000,
      name: '大阪営業部',
      meisai: [
        {
          id: 5100,
          name: '大阪営業所',
          address: '564-0053 大阪府吹田市江の木町7-22',
          tel: '06-4861-1170',
        },
        {
          id: 4100,
          name: '岐阜営業所',
          address: '501-6115 岐阜県岐阜市柳津町丸野4丁目93',
          tel: '058-388-1345',
        },
      ],
    },
  },
  {
    department: {
      id: 8000,
      name: 'マーケティング事業部',
      meisai: [
        {
          id: 8100,
          name: '東京マーケティング事業部',
          address: '110-0005 東京都台東区上野7丁目11-6 上野中央ビル4階',
          tel: '03-3845-5677',
        },
      ],
    },
  },
  {
    department: {
      id: 6000,
      name: '本店営業部',
      meisai: [
        {
          id: 6100,
          name: '中四国営業所',
          address: '799-0493 愛媛県四国中央市中曽根町1593',
          tel: '0896-24-2140',
        },
      ],
    },
  },
  {
    department: {
      id: 7000,
      name: '福岡営業部',
      meisai: [
        {
          id: 7100,
          name: '福岡営業所',
          address: '812-0051 福岡県福岡市東区箱崎ふ頭3丁目4-41',
          tel: '092-631-3400',
        },
        {
          id: 7200,
          name: '鹿児島出張所',
          address: '890-0007 鹿児島県鹿児島市伊敷台1丁目22-5 イオリドリーム1階',
          tel: '099-229-9234',
        },
      ],
    },
  },
  {
    department: {
      id: 10000,
      name: '関連企業',
      meisai: [
        {
          id: 10001,
          name: 'ダイコク化成（株）',
          address: '020-0052 岩手県盛岡市中太田25-11',
          tel: '0196-58-0650',
        },
        {
          id: 10002,
          name: '大黒美術紙工（株）',
          address: '799-0113 愛媛県四国中央市妻鳥町849-1',
          tel: '0896-56-0072',
        },
        {
          id: 10003,
          name: '大黒友愛紙工（株）',
          address: '799-0113 愛媛県四国中央市妻鳥町849-1',
          tel: '0896-56-0072',
        },
        {
          id: 10004,
          name: '（株）味大黒',
          address: '762-0053 香川県坂出市西大浜北2-3-11',
          tel: '0877-45-8437',
        },
        {
          id: 10005,
          name: '大黒物流（株）',
          address: '799-0493 愛媛県四国中央市中曽根町1593',
          tel: '0896-24-2140',
        },
        {
          id: 10006,
          name: '丸三化成（株）',
          address: '013-0102 秋田県横手市平鹿町醍醐字釜ノ川西228',
          tel: '0182-25-4403',
        },
      ],
    },
  },
  {
    department: {
      id: 20000,
      name: '国内工場・配送センター',
      meisai: [
        {
          id: 20001,
          name: '大黒美術紙工（株）美唄配送センター',
          address: '072-0006 北海道美唄市東五条北8丁目1-5',
          tel: '0126-62-5962',
        },
        {
          id: 20002,
          name: '大黒美術紙工（株）仙台工場',
          address: '984-0002 宮城県仙台市若林区卸町東5丁目3-2',
          tel: '022-287-3374',
        },
        {
          id: 20003,
          name: '大黒美術紙工（株）仙台配送センター',
          address: '984-0002 宮城県仙台市若林区卸町東5丁目3-2',
          tel: '022-287-3374',
        },
        {
          id: 20004,
          name: '大黒美術紙工（株）東日本配送センター',
          address: '959-1276 新潟県燕市小池字上通り5091-14',
          tel: '0256-66-4010',
        },
        {
          id: 20005,
          name: '大黒美術紙工（株）山本工場',
          address: '768-0104 香川県三豊市山本町神田山才乙288 神田中央工業団地内',
          tel: '0875-63-8511',
        },
        {
          id: 20006,
          name: '大黒友愛紙工（株）山本工場',
          address: '768-0104 香川県三豊市山本町神田山才乙288 神田中央工業団地内',
          tel: '0875-63-8511',
        },
        {
          id: 20007,
          name: '大黒美術紙工（株）西日本配送センター',
          address: '769-1502 香川県三豊市豊中町笠田笠岡3915-4（陣山工業団地内）',
          tel: '0875-62-6146',
        },
        {
          id: 20008,
          name: '大黒美術紙工（株）川之江工場',
          address: '799-0113 愛媛県四国中央市妻鳥町849-1',
          tel: '0896-56-0072',
        },
        {
          id: 20009,
          name: 'ダイコク化成（株）盛岡工場',
          address: '020-0052 岩手県盛岡市中太田25-11',
          tel: '0196-58-0650',
        },
        {
          id: 20010,
          name: 'ダイコク化成（株）盛岡配送センター',
          address: '028-3324 岩手県紫波郡紫波町東長岡字大平8',
          tel: '019-658-0650',
        },
      ],
    },
  },
  {
    department: {
      id: 30000,
      name: '海外事務所・工場',
      meisai: [
        {
          id: 30001,
          name: '大黒工業（株）煙台代表処',
          address: '中国山東省烟台市',
          tel: '',
        },
        {
          id: 30002,
          name: '大黒工業（株）上海駐在員事務所',
          address: '中国上海市松江区',
          tel: '',
        },
        {
          id: 30003,
          name: '烟台海湾塑料餐具有限公司',
          address: '中国山東省烟台市',
          tel: '',
        },
        {
          id: 30004,
          name: '烟台大力餐具有限公司',
          address: '中国山東省烟台市',
          tel: '',
        },
        {
          id: 30005,
          name: '煙台大茂包装制品有限公司',
          address: '中国山東省烟台市',
          tel: '',
        },
        {
          id: 30006,
          name: '乳山昌盛大力環保有限公司',
          address: '中国山東省乳山市',
          tel: '',
        },
        {
          id: 30007,
          name: '上海曜穎餐飲用品有限公司',
          address: '中国上海市松江区',
          tel: '',
        },
        {
          id: 30008,
          name: '旭耀紙業（上海）有限公司',
          address: '中国上海市松江区',
          tel: '',
        },
        {
          id: 30009,
          name: '（株）Daikoku Korea',
          address: '韓国京畿道金浦市',
          tel: '',
        },
        {
          id: 30010,
          name: '旭耀新材料科技有限公司',
          address: '江蘇省淮安市',
          tel: '',
        },
        {
          id: 30011,
          name: 'Daikoku（Thailand）Co.,Ltd',
          address: 'Amphur Bang Bo,Samutprakarn',
          tel: '',
        },
        {
          id: 30012,
          name: 'Fresh Mate（Thailand）Co.,Ltd',
          address: 'Amphur Bang Bo,Samutprakarn',
          tel: '',
        },
      ],
    },
  },
];
